Repository: gentpan/CLIState
Catalog: App/Resources/MenuBar.xcstrings
Source language: en
Languages: zh_hans

source: %@ is built into the shell, so PATH isn't used.
zh_hans: %@ 是 shell 内置命令，不会查找 PATH。

source: %@ is installed at %@ but isn't in PATH.
zh_hans: %@ 安装在 %@，但不在 PATH 中。

source: %@ runs %@
zh_hans: %@ 实际运行的是 %@

source: %lld critical
zh_hans: %lld 个严重

source: %lld critical issues need attention.
zh_hans: 其中 %lld 个严重问题需要处理。

source: %lld issues
zh_hans: %lld 个问题

source: %lld more updates
zh_hans: 还有 %lld 个更新

source: %lld notices
zh_hans: %lld 个提示

source: %lld tools
zh_hans: %lld 个工具

source: %lld updates available
zh_hans: %lld 个可更新

source: %lld warnings
zh_hans: %lld 个警告

source: A shell function named %@ runs before PATH.
zh_hans: 名为 %@ 的 shell 函数会先于 PATH 执行。

source: Active Path
zh_hans: 当前路径

source: All tools are up to date
zh_hans: 所有工具都是最新版本

source: All tools are up to date.
zh_hans: 所有工具都是最新版本。

source: An alias named %@ runs before PATH.
zh_hans: 名为 %@ 的别名会先于 PATH 执行。

source: Check for CLI Updates
zh_hans: 检查 CLI 更新

source: Check for Updates
zh_hans: 检查更新

source: Checking for updates…
zh_hans: 正在检查更新…

source: Checks package managers and installers for newer versions and returns the tools that can be updated. Nothing is installed.
zh_hans: 向包管理器和安装程序查询新版本，返回可以更新的工具。不会安装任何内容。

source: CLI Tool
zh_hans: CLI 工具

source: CLI Update
zh_hans: CLI 更新

source: CLI State couldn't scan your environment. Open CLI State for details.
zh_hans: CLI State 无法扫描你的环境。请打开 CLI State 查看详情。

source: Command
zh_hans: 命令

source: Command Lookup
zh_hans: 命令查询

source: Critical Issues
zh_hans: 严重问题

source: Environment Summary
zh_hans: 环境摘要

source: Found %@.
zh_hans: 发现 %@。

source: Installed Version
zh_hans: 已安装版本

source: Installed Via
zh_hans: 安装方式

source: Issues
zh_hans: 问题

source: Last scan failed
zh_hans: 上次扫描失败

source: Latest Version
zh_hans: 最新版本

source: Look up ${command}
zh_hans: 查询 ${command}

source: Look Up Command
zh_hans: 查询命令

source: Name
zh_hans: 名称

source: No command named %@ was found in PATH.
zh_hans: 在 PATH 中找不到名为 %@ 的命令。

source: Not in PATH
zh_hans: 不在 PATH 中

source: Not scanned yet
zh_hans: 尚未扫描

source: Open ${tool}
zh_hans: 打开 ${tool}

source: Open CLI State
zh_hans: 打开 CLI State

source: Open Tool
zh_hans: 打开工具

source: Open Tool in CLI State
zh_hans: 在 CLI State 中打开工具

source: Opens CLI State with the tool selected.
zh_hans: 打开 CLI State 并选中该工具。

source: Quit CLI State
zh_hans: 退出 CLI State

source: Refresh package info and check for updates
zh_hans: 强制刷新：重新下载软件包信息并检查更新

source: Rescans installed CLI tools, PATH and package managers, and returns how many tools, updates and issues CLI State found. Doesn't check the network for new versions.
zh_hans: 重新扫描已安装的 CLI 工具、PATH 和包管理器，返回 CLI State 发现的工具、可更新项和问题数量。不会联网检查新版本。

source: Review the updates in CLI State before anything runs
zh_hans: 先在 CLI State 中确认，确认后才会开始更新

source: Running an operation…
zh_hans: 正在执行操作…

source: Scan Development Environment
zh_hans: 扫描开发环境

source: Scan Environment
zh_hans: 扫描环境

source: Scan Now
zh_hans: 立即扫描

source: Scanned %@
zh_hans: %@扫描

source: Scanned At
zh_hans: 扫描时间

source: Scanned just now
zh_hans: 刚刚扫描

source: Scanning…
zh_hans: 正在扫描…

source: Settings…
zh_hans: 设置…

source: Shadowed Paths
zh_hans: 被遮蔽的路径

source: Shadows: %@
zh_hans: 遮蔽了：%@

source: Show %@ in CLI State
zh_hans: 在 CLI State 中查看 %@

source: Show All %lld
zh_hans: 查看全部 %lld

source: Show in menu bar
zh_hans: 在菜单栏中显示

source: Shows which executable the terminal runs for a command, its version, how it was installed and which other copies it shadows. Uses the latest scan and runs nothing.
zh_hans: 显示终端为某个命令实际运行的可执行文件、它的版本和安装方式，以及它遮蔽了哪些副本。基于最近一次扫描，不运行任何程序。

source: Summary
zh_hans: 摘要

source: The shell remembers an earlier location for %@; run hash -r to forget it.
zh_hans: shell 缓存了 %@ 之前的位置；运行 hash -r 可清除缓存。

source: This tool isn't in the latest scan. Scan again, then try again.
zh_hans: 最近一次扫描中没有这个工具。请重新扫描后再试。

source: Tool
zh_hans: 工具

source: Tools
zh_hans: 工具

source: Update All…
zh_hans: 全部更新…

source: Updates
zh_hans: 可更新的工具

source: Updates and issues at a glance. CLI State keeps running after you close its window.
zh_hans: 随时查看可更新项和问题。关闭窗口后 CLI State 会继续在后台运行。

source: Updates Available
zh_hans: 可更新

source: Updates available (%lld): %@.
zh_hans: %lld 个工具可更新：%@。

source: Version
zh_hans: 版本

source: Version: %@ · Installed via %@
zh_hans: 版本：%@ · 安装方式：%@

source: Waiting for the first scan…
zh_hans: 正在等待首次扫描…
